monadas.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-07-01 Sun 11:10 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Mónadas</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Mario Román" />
<link rel="stylesheet" href="default.css" />
<link rel="stylesheet" href="mathjax_fonts.css" />
<link rel="stylesheet" href="syntax.css" />
<div id="header">
<div id="logo">
<a href="index.html">Cosmoi</a>
</div>
<div id="navigation">
<a href="index.html">Index</a>
<a href="about.html">About</a>
</div>
</div>
</head>
<body>
<div id="content">
<h1 class="title">Mónadas</h1>
<blockquote>
<p>
A monad is just a monoid in the category of endofunctors, what's the
problem?
</p>

<p>
&#x2013; <b>Philip Walder</b> (apócrifa) en <i><a href="http://james-iry.blogspot.com.es/2009/05/brief-incomplete-and-mostly-wrong.html">A Brief, Incomplete, and Mostly Wrong History of programming languages</a></i>
</p>
</blockquote>

<div id="outline-container-org8afc196" class="outline-2">
<h2 id="org8afc196">Prerrequisitos</h2>
<div class="outline-text-2" id="text-org8afc196">
<p>
Este artículo requiere un conocimiento previo de Haskell, o al menos, de
otro lenguaje de programación funcional. Puedes consultar nuestra
<a href="http://tux.ugr.es/dgiim/blog/2014/10/01/intro-haskell/">introducción a Haskell</a> con recursos para iniciarte en el lenguaje.
</p>

<p>
Por otro lado, para la segunda parte del artículo es recomendable
conocimiento previo sobre teoría de categorías. Aun así, no es necesaria
para leer la primera parte del artículo, donde hablamos de mónadas sin
hacer ninguna referencia explícita a la teoría de categorías. Si quieres
leer sobre ese tema, puedes consultar nuestros apuntes de
<a href="http://tux.ugr.es/dgiim/blog/2014/10/04/intro-categorias/">introducción a teoría de categorías</a>.
</p>
</div>
</div>

<div id="outline-container-org896a3fd" class="outline-2">
<h2 id="org896a3fd">Motivación para las mónadas</h2>
<div class="outline-text-2" id="text-org896a3fd">
</div>
<div id="outline-container-orge83496a" class="outline-3">
<h3 id="mónadas-en-haskell"><a id="orge83496a"></a>Mónadas en Haskell</h3>
<div class="outline-text-3" id="text-mónadas-en-haskell">
<p>
Imaginemos que necesitamos controlar cuando una función interna devuelve
un error, o cuando usa un estado que debe ser pasado al resto de
funciones. Cuando trabajamos con programación funcional pura, debemos
devolver explícitamente el error (señalar cómo va a tratarlo cada
función) o pasar el estado como argumento a cada una de las funciones;
así que una solución sería modificar cada una de las funciones que
usamos para que tenga en cuenta ese estado o ese caso de error, pero
esto añadiría mucha complejidad innecesaria a nuestro código. La
estructura de mónada simplifica esta escritura.
</p>

<p>
El siguiente ejemplo, en el que tratamos el manejo de errores
encapsulado en una mónada, está inspirado en los ejemplos de:
</p>

<ul class="org-ul">
<li><a href="http://homepages.inf.ed.ac.uk/wadler/papers/marktoberdorf/baastad.pdf">Monads for functional programming</a> - <i>Philip Wadler</i></li>
</ul>

<p>
Que es una muy buena introducción al uso de las mónadas en programación
funcional.
</p>
</div>
</div>

<div id="outline-container-orgc029e03" class="outline-3">
<h3 id="orgc029e03">Calculando raíces cuadradas</h3>
<div class="outline-text-3" id="text-orgc029e03">
<p>
Por ejemplo, supongamos que intentamos sacar raíces cuadradas en los
reales usando el <a href="https://en.wikipedia.org/wiki/Integer_square_root#Algorithm">método de Newton</a>. Si intentamos calcular \(\sqrt{n}\), 
podemos tomar a cada paso la aproximación:
</p>

<p>
\[ x_{k+1} = \frac{1}{2}\left( x_k+\frac{n}{x_k} \right) \]
</p>

<p>
Y parar cuando estemos suficientemente cerca (más cerca que un ε dado):
</p>

<p>
\[ |x_{k+1} - x_k| < \varepsilon \]
</p>

<p>
Escribimos una implementación de ese concepto de convergencia para
listas infinitas en Haskell y del método de Newton, basado en la función
<a href="http://hackage.haskell.org/package/base-4.9.0.0/docs/Prelude.html#v:iterate"><code>iterate</code></a>:
</p>

<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #cae682;">limit</span> <span style="color: #cae682;">::</span> <span style="color: #92a65e; font-weight: bold;">Float</span> <span style="color: #cae682;">-&gt;</span> <span style="color: #DCDCCC;">[</span><span style="color: #92a65e; font-weight: bold;">Float</span><span style="color: #DCDCCC;">]</span> <span style="color: #cae682;">-&gt;</span> <span style="color: #92a65e; font-weight: bold;">Float</span>
<span style="color: #cae682;">limit</span> epsilon <span style="color: #DCDCCC;">(</span>x<span style="color: #92a65e; font-weight: bold;">:</span>y<span style="color: #92a65e; font-weight: bold;">:</span>xs<span style="color: #DCDCCC;">)</span>
  <span style="color: #cae682;">|</span> abs <span style="color: #DCDCCC;">(</span>x<span style="color: #cae682;">-</span>y<span style="color: #DCDCCC;">)</span> <span style="color: #cae682;">&lt;</span> epsilon <span style="color: #cae682;">=</span> y
  <span style="color: #cae682;">|</span> otherwise           <span style="color: #cae682;">=</span> limit epsilon <span style="color: #DCDCCC;">(</span>y<span style="color: #92a65e; font-weight: bold;">:</span>xs<span style="color: #DCDCCC;">)</span>

<span style="color: #cae682;">newtonaprox</span> <span style="color: #cae682;">::</span> <span style="color: #92a65e; font-weight: bold;">Float</span> <span style="color: #cae682;">-&gt;</span> <span style="color: #92a65e; font-weight: bold;">Float</span> <span style="color: #cae682;">-&gt;</span> <span style="color: #92a65e; font-weight: bold;">Float</span>
<span style="color: #cae682;">newtonaprox</span> n x <span style="color: #cae682;">=</span> <span style="color: #DCDCCC;">(</span>x <span style="color: #cae682;">+</span> n<span style="color: #cae682;">/</span>x<span style="color: #DCDCCC;">)</span><span style="color: #cae682;">/</span>2

<span style="color: #cae682;">sqroot</span> <span style="color: #cae682;">::</span> <span style="color: #92a65e; font-weight: bold;">Float</span> <span style="color: #cae682;">-&gt;</span> <span style="color: #92a65e; font-weight: bold;">Float</span>
<span style="color: #cae682;">sqroot</span> 0 <span style="color: #cae682;">=</span> 0
<span style="color: #cae682;">sqroot</span> x <span style="color: #cae682;">=</span> limit 0.03 <span style="color: #DCDCCC;">(</span>iterate <span style="color: #BFEBBF;">(</span>newtonaprox x<span style="color: #BFEBBF;">)</span> x<span style="color: #DCDCCC;">)</span>
</pre>
</div>

<p>
Ahora imaginemos que usamos esta raíz cuadrada recién definida para
solucionar una ecuación de segundo grado \(x^2 + bx + c = 0\):
</p>

<p>
\[ x = \frac{-b \pm \sqrt{b^2 - 4c}}{2} \]
</p>

<p>
Podemos definir una estructura de datos <code>QPol</code> para el polinomio y una
función que lo resuelva obteniendo sus dos raíces:
</p>

<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #8ac6f2; font-weight: bold;">data</span> <span style="color: #92a65e; font-weight: bold;">QPol</span> <span style="color: #cae682;">=</span> <span style="color: #92a65e; font-weight: bold;">QPol</span> <span style="color: #92a65e; font-weight: bold;">Float</span> <span style="color: #92a65e; font-weight: bold;">Float</span> <span style="color: #92a65e; font-weight: bold;">Float</span>

<span style="color: #8ac6f2; font-weight: bold;">instance</span> <span style="color: #92a65e; font-weight: bold;">Show</span> <span style="color: #92a65e; font-weight: bold;">QPol</span> <span style="color: #8ac6f2; font-weight: bold;">where</span>
    show <span style="color: #DCDCCC;">(</span><span style="color: #92a65e; font-weight: bold;">Qpol</span> a b c<span style="color: #DCDCCC;">)</span> <span style="color: #cae682;">=</span> show a <span style="color: #cae682;">++</span> <span style="color: #95e454;">"x&#178; + "</span> <span style="color: #cae682;">++</span> show b <span style="color: #cae682;">++</span> <span style="color: #95e454;">"x + "</span> show c

<span style="color: #cae682;">solve</span> <span style="color: #cae682;">::</span> <span style="color: #92a65e; font-weight: bold;">QPol</span> <span style="color: #cae682;">-&gt;</span> <span style="color: #DCDCCC;">(</span><span style="color: #92a65e; font-weight: bold;">Float</span>,<span style="color: #92a65e; font-weight: bold;">Float</span><span style="color: #DCDCCC;">)</span>
<span style="color: #cae682;">solve</span> <span style="color: #DCDCCC;">(</span><span style="color: #92a65e; font-weight: bold;">QPol</span> a b c<span style="color: #DCDCCC;">)</span> <span style="color: #cae682;">=</span> <span style="color: #DCDCCC;">(</span>sol1 sol2<span style="color: #DCDCCC;">)</span>
    <span style="color: #8ac6f2; font-weight: bold;">where</span> sol1 <span style="color: #cae682;">=</span> <span style="color: #DCDCCC;">(</span><span style="color: #BFEBBF;">(</span><span style="color: #cae682;">-</span>b<span style="color: #BFEBBF;">)</span> <span style="color: #cae682;">+</span> sqroot<span style="color: #BFEBBF;">(</span>b<span style="color: #cae682;">*</span>b<span style="color: #cae682;">-</span>4<span style="color: #cae682;">*</span>c<span style="color: #cae682;">*</span>a<span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span><span style="color: #cae682;">/</span><span style="color: #DCDCCC;">(</span>2<span style="color: #cae682;">*</span>a<span style="color: #DCDCCC;">)</span>
          sol2 <span style="color: #cae682;">=</span> <span style="color: #DCDCCC;">(</span><span style="color: #BFEBBF;">(</span><span style="color: #cae682;">-</span>b<span style="color: #BFEBBF;">)</span> <span style="color: #cae682;">-</span> sqroot<span style="color: #BFEBBF;">(</span>b<span style="color: #cae682;">*</span>b<span style="color: #cae682;">-</span>4<span style="color: #cae682;">*</span>c<span style="color: #cae682;">*</span>a<span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span><span style="color: #cae682;">/</span><span style="color: #DCDCCC;">(</span>2<span style="color: #cae682;">*</span>a<span style="color: #DCDCCC;">)</span>
</pre>
</div>

<p>
Y podemos comprobar que funciona:
</p>

<pre class="example">
λ&gt; pol = QPol 1 (-5) 6
λ&gt; putStrLn $ "Las soluciones de " ++ show pol ++ " son " ++ solve pol
Las soluciones de 1.0x² + -5.0x + 6.0 son (3.0,2.0)
</pre>
</div>
</div>
