monadas.html

<div id="outline-container-orgff5244e" class="outline-3">
<h3 id="orgff5244e">Controlando los errores</h3>
<div class="outline-text-3" id="text-orgff5244e">
<p>
Pero ¿qué ocurre cuando intentamos calcular la raíz cuadrada de un
número no positivo? Este método no la encuentra, por lo que debería
devolver un error antes de intentar empezar a calcularla. La solución
obvia es reflejar este error con un <code>Maybe</code> en el cálculo de la raíz
cuadrada.
</p>

<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #cae682;">sqroot'</span> <span style="color: #cae682;">::</span> <span style="color: #92a65e; font-weight: bold;">Float</span> <span style="color: #cae682;">-&gt;</span> <span style="color: #92a65e; font-weight: bold;">Maybe</span> <span style="color: #92a65e; font-weight: bold;">Float</span>
<span style="color: #cae682;">sqroot'</span> x
  <span style="color: #cae682;">|</span> x <span style="color: #cae682;">&lt;</span> 0     <span style="color: #cae682;">=</span> <span style="color: #92a65e; font-weight: bold;">Nothing</span>
  <span style="color: #cae682;">|</span> x <span style="color: #cae682;">==</span> 0    <span style="color: #cae682;">=</span> <span style="color: #92a65e; font-weight: bold;">Just</span> 0.0
  <span style="color: #cae682;">|</span> otherwise <span style="color: #cae682;">=</span> <span style="color: #92a65e; font-weight: bold;">Just</span> <span style="color: #DCDCCC;">(</span> limit 0.03 <span style="color: #BFEBBF;">(</span>iterate <span style="color: #D0BF8F;">(</span>newtonsqrt x<span style="color: #D0BF8F;">)</span> x<span style="color: #BFEBBF;">)</span> <span style="color: #DCDCCC;">)</span>
</pre>
</div>

<p>
Esto lo soluciona, pero nos crea un problema mayor. La función <code>solve</code>
está usando la raíz cuadrada y se espera de ella que devuelva un número,
no un posible error. Si queremos conseguir que funcione con la nueva
<code>sqroot'</code>, necesitaríamos implementar todas sus componentes internas
teniendo en cuenta ese error. Por ejemplo, deberíamos reescribir el
<code>(+)</code>, para tener en cuenta errores y propagarlos por todos los cálculos
involucrando a <code>sqroot'</code>:
</p>

<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #DCDCCC;">(</span><span style="color: #cae682;">+.</span><span style="color: #DCDCCC;">)</span> <span style="color: #cae682;">::</span> <span style="color: #92a65e; font-weight: bold;">Maybe</span> <span style="color: #92a65e; font-weight: bold;">Float</span> <span style="color: #cae682;">-&gt;</span> <span style="color: #92a65e; font-weight: bold;">Maybe</span> <span style="color: #92a65e; font-weight: bold;">Float</span> <span style="color: #cae682;">-&gt;</span> <span style="color: #92a65e; font-weight: bold;">Maybe</span> <span style="color: #92a65e; font-weight: bold;">Float</span>
<span style="color: #DCDCCC;">(</span><span style="color: #cae682;">+.</span><span style="color: #DCDCCC;">)</span> <span style="color: #92a65e; font-weight: bold;">Nothing</span> <span style="color: #8ac6f2; font-weight: bold;">_</span> <span style="color: #cae682;">=</span> <span style="color: #92a65e; font-weight: bold;">Nothing</span>
<span style="color: #DCDCCC;">(</span><span style="color: #cae682;">+.</span><span style="color: #DCDCCC;">)</span> <span style="color: #8ac6f2; font-weight: bold;">_</span> <span style="color: #92a65e; font-weight: bold;">Nothing</span> <span style="color: #cae682;">=</span> <span style="color: #92a65e; font-weight: bold;">Nothing</span>
<span style="color: #DCDCCC;">(</span><span style="color: #cae682;">+.</span><span style="color: #DCDCCC;">)</span> <span style="color: #DCDCCC;">(</span><span style="color: #92a65e; font-weight: bold;">Just</span> a<span style="color: #DCDCCC;">)</span> <span style="color: #DCDCCC;">(</span><span style="color: #92a65e; font-weight: bold;">Just</span> b<span style="color: #DCDCCC;">)</span> <span style="color: #cae682;">=</span> <span style="color: #92a65e; font-weight: bold;">Just</span> <span style="color: #DCDCCC;">(</span>a <span style="color: #cae682;">+</span> b<span style="color: #DCDCCC;">)</span>
</pre>
</div>

<p>
Pero esto es muy pesado de implementar; deberíamos implementarlo ¡para
cada una de las operaciones que usen la raíz cuadrada en algún punto!
Esto obliga a cada una de nuestras operaciones intermedias a ser
conscientes de la posibilidad de error, dándonos código mucho menos
modular y reusable.
</p>

<p>
Una solución ligeramente mejor es la de abstraer este proceso de hacer a
una función consciente de la posibilidad de error en una función aparte
y definir las demás en función suya:
</p>

<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #cae682;">errorAware</span> <span style="color: #cae682;">::</span> <span style="color: #DCDCCC;">(</span>a <span style="color: #cae682;">-&gt;</span> b <span style="color: #cae682;">-&gt;</span> c<span style="color: #DCDCCC;">)</span> <span style="color: #cae682;">-&gt;</span> <span style="color: #92a65e; font-weight: bold;">Maybe</span> a <span style="color: #cae682;">-&gt;</span> <span style="color: #92a65e; font-weight: bold;">Maybe</span> b <span style="color: #cae682;">-&gt;</span> <span style="color: #92a65e; font-weight: bold;">Maybe</span> c
<span style="color: #cae682;">errorAware</span> op <span style="color: #92a65e; font-weight: bold;">Nothing</span> <span style="color: #8ac6f2; font-weight: bold;">_</span> <span style="color: #cae682;">=</span> <span style="color: #92a65e; font-weight: bold;">Nothing</span>
<span style="color: #cae682;">errorAware</span> op <span style="color: #8ac6f2; font-weight: bold;">_</span> <span style="color: #92a65e; font-weight: bold;">Nothing</span> <span style="color: #cae682;">=</span> <span style="color: #92a65e; font-weight: bold;">Nothing</span>
<span style="color: #cae682;">errorAware</span> op <span style="color: #DCDCCC;">(</span><span style="color: #92a65e; font-weight: bold;">Just</span> a<span style="color: #DCDCCC;">)</span> <span style="color: #DCDCCC;">(</span><span style="color: #92a65e; font-weight: bold;">Just</span> b<span style="color: #DCDCCC;">)</span> <span style="color: #cae682;">=</span> <span style="color: #92a65e; font-weight: bold;">Just</span> <span style="color: #DCDCCC;">(</span>op a b<span style="color: #DCDCCC;">)</span>

<span style="color: #DCDCCC;">(</span><span style="color: #cae682;">+.</span><span style="color: #DCDCCC;">)</span>, <span style="color: #DCDCCC;">(</span><span style="color: #cae682;">*.</span><span style="color: #DCDCCC;">)</span> <span style="color: #cae682;">::</span> <span style="color: #92a65e; font-weight: bold;">Maybe</span> <span style="color: #92a65e; font-weight: bold;">Float</span> <span style="color: #cae682;">-&gt;</span> <span style="color: #92a65e; font-weight: bold;">Maybe</span> <span style="color: #92a65e; font-weight: bold;">Float</span> <span style="color: #cae682;">-&gt;</span> <span style="color: #92a65e; font-weight: bold;">Maybe</span> <span style="color: #92a65e; font-weight: bold;">Float</span>
<span style="color: #DCDCCC;">(</span><span style="color: #cae682;">+.</span><span style="color: #DCDCCC;">)</span> <span style="color: #cae682;">=</span> errorAware <span style="color: #DCDCCC;">(</span><span style="color: #cae682;">+</span><span style="color: #DCDCCC;">)</span>
<span style="color: #DCDCCC;">(</span><span style="color: #cae682;">*.</span><span style="color: #DCDCCC;">)</span> <span style="color: #cae682;">=</span> errorAware <span style="color: #DCDCCC;">(</span><span style="color: #cae682;">*</span><span style="color: #DCDCCC;">)</span>
</pre>
</div>

<p>
Esto nos permite hacer cálculos con ellas:
</p>

<pre class="example">
λ&gt; sqroot' (-3) +. Just 4
Nothing
λ&gt; sqroot' 3 +. Just 4
Just 5.732143
</pre>
</div>
</div>

<div id="outline-container-orgcbe28f3" class="outline-3">
<h3 id="orgcbe28f3">La mónada Maybe</h3>
<div class="outline-text-3" id="text-orgcbe28f3">
<p>
Esta idea para simplificar el tratamiento de errores, realizada
correctamente, es lo que nos va a proporcionar la estructura de mónada.
En Haskell, podemos definir una mónada como:
</p>

<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #8ac6f2; font-weight: bold;">class</span> <span style="color: #92a65e; font-weight: bold;">Monad</span> m <span style="color: #8ac6f2; font-weight: bold;">where</span>
  <span style="color: #DCDCCC;">(</span><span style="color: #cae682;">&gt;&gt;=</span><span style="color: #DCDCCC;">)</span>  <span style="color: #cae682;">::</span> m a <span style="color: #cae682;">-&gt;</span> <span style="color: #DCDCCC;">(</span>a <span style="color: #cae682;">-&gt;</span> m b<span style="color: #DCDCCC;">)</span> <span style="color: #cae682;">-&gt;</span> m b
  return <span style="color: #cae682;">::</span> a <span style="color: #cae682;">-&gt;</span> m a
</pre>
</div>

<p>
La idea intuitiva es que <code>(&gt;&gt;</code>)= nos permite tomar una función que puede
devolver errores pero que no comprueba a la entrada si ha recibido un
error, es decir, de tipo <code>(a -&gt; Maybe b)</code> ; y aplicarla sobre una
función que puede contener un error. La podríamos usar por ejemplo para
componer varias <code>sqroot'</code>, que era algo que hasta ahora no podíamos
hacer sin tratar cada posible caso de error. Y la función <code>return</code>, que
en este caso es simplemente <code>Just</code>, nos permite considerar una constante
como un posible error. Podemos calcular fácilmente así
\[\sqrt{\sqrt{3}}\] teniendo en cuenta los casos de error:
</p>

<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #cae682;">sqroot'</span> <span style="color: #DCDCCC;">(</span>sqroot' 3<span style="color: #DCDCCC;">)</span>              <span style="color: #5F7F5F;">-- </span><span style="color: #99968b;">&#161;Error de tipos!</span>
<span style="color: #cae682;">sqroot'</span> 3 <span style="color: #cae682;">&gt;&gt;=</span> sqroot'            <span style="color: #5F7F5F;">-- </span><span style="color: #99968b;">Usando m&#243;nadas</span>
<span style="color: #92a65e; font-weight: bold;">Just</span>   3 <span style="color: #cae682;">&gt;&gt;=</span> sqroot' <span style="color: #cae682;">&gt;&gt;=</span> sqroot' <span style="color: #5F7F5F;">-- </span><span style="color: #99968b;">Usando Just</span>
<span style="color: #cae682;">return</span> 3 <span style="color: #cae682;">&gt;&gt;=</span> sqroot' <span style="color: #cae682;">&gt;&gt;=</span> sqroot' <span style="color: #5F7F5F;">-- </span><span style="color: #99968b;">Equivalente a lo anterior</span>
</pre>
</div>
</div>
</div>
