monadas.html

<div id="outline-container-orgbb6dc41" class="outline-3">
<h3 id="orgbb6dc41">Notación do</h3>
<div class="outline-text-3" id="text-orgbb6dc41">
<p>
Las mónadas definen las funciones anteriores y muchas más que no vamos a
tratar ahora mismo, pero como resultado, nos acaban ofreciendo la
<b><a href="https://en.wikibooks.org/wiki/Haskell/do_notation">notación do</a></b>,
que es la que podemos usar para acabar escribiendo nuestra función
<code>solve</code> como:
</p>

<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #cae682;">solve</span> <span style="color: #cae682;">::</span> <span style="color: #92a65e; font-weight: bold;">QPol</span> <span style="color: #cae682;">-&gt;</span> <span style="color: #92a65e; font-weight: bold;">Maybe</span> <span style="color: #DCDCCC;">(</span><span style="color: #92a65e; font-weight: bold;">Float</span>,<span style="color: #92a65e; font-weight: bold;">Float</span><span style="color: #DCDCCC;">)</span>
<span style="color: #cae682;">solve</span> <span style="color: #DCDCCC;">(</span><span style="color: #92a65e; font-weight: bold;">QPol</span> a b c<span style="color: #DCDCCC;">)</span> <span style="color: #cae682;">=</span> <span style="color: #8ac6f2; font-weight: bold;">do</span>
  discriminant <span style="color: #cae682;">&lt;-</span> sqroot' <span style="color: #DCDCCC;">(</span>b<span style="color: #cae682;">*</span>b <span style="color: #cae682;">-</span> 4<span style="color: #cae682;">*</span>c<span style="color: #cae682;">*</span>a<span style="color: #DCDCCC;">)</span>
  return <span style="color: #DCDCCC;">(</span><span style="color: #BFEBBF;">(</span><span style="color: #D0BF8F;">(</span><span style="color: #cae682;">-</span>b<span style="color: #D0BF8F;">)</span> <span style="color: #cae682;">+</span> discriminant<span style="color: #BFEBBF;">)</span><span style="color: #cae682;">/</span><span style="color: #BFEBBF;">(</span>2<span style="color: #cae682;">*</span>a<span style="color: #BFEBBF;">)</span>, <span style="color: #BFEBBF;">(</span><span style="color: #D0BF8F;">(</span><span style="color: #cae682;">-</span>b<span style="color: #D0BF8F;">)</span> <span style="color: #cae682;">-</span> discriminant<span style="color: #BFEBBF;">)</span><span style="color: #cae682;">/</span><span style="color: #BFEBBF;">(</span>2<span style="color: #cae682;">*</span>a<span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>
</pre>
</div>

<p>
En la primera línea tenemos en cuenta que la función <code>sqroot</code> puede
producir error, y en la segunda simplemente usamos el <i>posible</i>
resultado de ella sin tener que preocuparnos por el resto de funciones.
</p>

<p>
Nótese que la notación <b>do</b> es sólo una notación diseñada para aliviar
la escritura de operaciones con mónadas en algunos casos particulares;
es sólo <i>azúcar sintáctico</i> para operaciones que no dejan de ser
puramente funcionales. Existen críticas al uso de esta notación. [1]
</p>
</div>
</div>
</div>

<div id="outline-container-org4f2bba0" class="outline-2">
<h2 id="org4f2bba0">Mónadas en programación funcional</h2>
<div class="outline-text-2" id="text-org4f2bba0">
</div>
<div id="outline-container-orgec73ea4" class="outline-3">
<h3 id="orgec73ea4">Mónadas como clase de tipos</h3>
<div class="outline-text-3" id="text-orgec73ea4">
<p>
Las mónadas en Haskell están definidas como una clase de tipos teniendo:
</p>

<ul class="org-ul">
<li>Un <b>constructor</b> de tipos <code>m ∷ * -&gt; *</code>, que para cada tipo <code>a</code>,
devuelve una mónada conteniéndolo, <code>m a</code>.</li>
<li>Una <b>función</b> <code>return ∷ a -&gt; m a</code>, que para todo elemento de tipo
<code>a</code>, devuelve una mónada que lo contiene.</li>
<li>Una <b>función</b> <code>(&gt;&gt;=) ∷ m a -&gt; (a -&gt; m b) -&gt; m b</code>, que dada una
mónada y una función que se aplique sobre su interior y devuelva otra
mónada, devuelve la mónada resultante. Sirve como composición de
funciones monádicas.</li>
</ul>

<p>
La existencia de la última función equivale a la existencia de otras dos
funciones <code>fmap ∷ (a -&gt; b) -&gt; m a -&gt; m b</code> y <code>join ∷ m (m a) -&gt; m a</code>.
</p>

<p>
Nótese entonces que para ser mónada, una clase de tipos debe ser primero
un funtor. Dentro de los funtores que conocemos, podemos reconocer
algunas mónadas, incluyendo la mónada <code>Maybe</code> que hemos usado hasta
ahora:
</p>

<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #5F7F5F;">-- </span><span style="color: #99968b;">Return de la m&#243;nada Maybe</span>
<span style="color: #cae682;">return</span> x <span style="color: #cae682;">=</span> <span style="color: #92a65e; font-weight: bold;">Just</span> x

<span style="color: #5F7F5F;">-- </span><span style="color: #99968b;">Bind de la m&#243;nada Maybe</span>
<span style="color: #DCDCCC;">(</span><span style="color: #92a65e; font-weight: bold;">Just</span> x<span style="color: #DCDCCC;">)</span> <span style="color: #cae682;">&gt;&gt;=</span> k <span style="color: #cae682;">=</span> k x
<span style="color: #92a65e; font-weight: bold;">Nothing</span>  <span style="color: #cae682;">&gt;&gt;=</span> <span style="color: #8ac6f2; font-weight: bold;">_</span> <span style="color: #cae682;">=</span> <span style="color: #92a65e; font-weight: bold;">Nothing</span>

<span style="color: #5F7F5F;">-- </span><span style="color: #99968b;">Return de la m&#243;nada List</span>
<span style="color: #cae682;">return</span> x <span style="color: #cae682;">=</span> <span style="color: #DCDCCC;">[</span>x<span style="color: #DCDCCC;">]</span>

<span style="color: #5F7F5F;">-- </span><span style="color: #99968b;">Bind de la m&#243;nada List</span>
xs <span style="color: #cae682;">&gt;&gt;=</span> f <span style="color: #cae682;">=</span> <span style="color: #DCDCCC;">[</span>y <span style="color: #cae682;">|</span> x <span style="color: #cae682;">&lt;-</span> xs, y <span style="color: #cae682;">&lt;-</span> f x<span style="color: #DCDCCC;">]</span>
</pre>
</div>

<p>
Puedes empezar a leer tutoriales sobre el uso de las mónadas en Haskell
en:
</p>

<ul class="org-ul">
<li><a href="http://learnyouahaskell.com/a-fistful-of-monads">A fistful of monads - Learn you a Haskell</a></li>
<li><a href="https://en.wikibooks.org/wiki/Haskell/Understanding_monads">Understanding monads - Wikibooks</a></li>
</ul>
</div>
</div>

<div id="outline-container-orga7cfc33" class="outline-3">
<h3 id="orga7cfc33">Mónada lista</h3>
<div class="outline-text-3" id="text-orga7cfc33">
<p>
En las listas, por ejemplo, tenemos como candidato para
<code>join :: [[a]] -&gt; [a]</code> la concatenación de listas, <code>concat</code>. Nuestro
<code>return :: a -&gt; [a]</code> será simplemente incluir un elemento en una lista
que sólo lo contenga a él.
</p>

<p>
En esta mónada, <code>(&gt;&gt;</code>)= mapea una función <code>a -&gt; [a]</code> sobre cada elemento
de la lista y concatena todos los resultados:
</p>

<pre class="example">
λ&gt; [1,2,3] &gt;&gt;= (replicate 3)
[1,1,1,2,2,2,3,3,3]
</pre>

<p>
Nótese que, de la misma manera en la que podemos usar <code>(&gt;&gt;</code>)=, podemos
usar una versión con sus parámetros cambiados de orden, <code>(=&lt;&lt;)</code>. Aquí
usamos la mónada lista para enumerar los racionales repitiendo
elementos:[2]
</p>

<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #8ac6f2; font-weight: bold;">import</span> <span style="color: #92a65e; font-weight: bold;">Data.List</span>
<span style="color: #8ac6f2; font-weight: bold;">import</span> <span style="color: #92a65e; font-weight: bold;">Data.Ratio</span>

<span style="color: #5F7F5F;">-- </span><span style="color: #99968b;">Crea los racionales con denominador n</span>
<span style="color: #cae682;">withDenom</span> <span style="color: #cae682;">::</span> <span style="color: #92a65e; font-weight: bold;">Integral</span> <span style="color: #cae682;">-&gt;</span> <span style="color: #DCDCCC;">[</span><span style="color: #92a65e; font-weight: bold;">Rational</span><span style="color: #DCDCCC;">]</span>
<span style="color: #cae682;">withDenom</span> n <span style="color: #cae682;">=</span> map <span style="color: #DCDCCC;">(</span><span style="color: #cae682;">%</span>n<span style="color: #DCDCCC;">)</span> <span style="color: #DCDCCC;">[</span>1<span style="color: #cae682;">..</span><span style="color: #DCDCCC;">]</span>

<span style="color: #5F7F5F;">-- </span><span style="color: #99968b;">Para cada entero, crea los racionales que lo</span>
<span style="color: #5F7F5F;">-- </span><span style="color: #99968b;">tienen como denominador</span>
<span style="color: #cae682;">rationalsDup</span> <span style="color: #cae682;">::</span> <span style="color: #DCDCCC;">[</span><span style="color: #92a65e; font-weight: bold;">Rational</span><span style="color: #DCDCCC;">]</span>
<span style="color: #cae682;">rationalsDup</span> <span style="color: #cae682;">=</span> withDenom <span style="color: #cae682;">=&lt;&lt;</span> <span style="color: #DCDCCC;">[</span>1<span style="color: #cae682;">..</span><span style="color: #DCDCCC;">]</span>

<span style="color: #5F7F5F;">-- </span><span style="color: #99968b;">Evita duplicados con 'nub'</span>
<span style="color: #cae682;">rationals</span> <span style="color: #cae682;">::</span> <span style="color: #DCDCCC;">[</span><span style="color: #92a65e; font-weight: bold;">Rational</span><span style="color: #DCDCCC;">]</span>
<span style="color: #cae682;">rationals</span> <span style="color: #cae682;">=</span> nub rationalsDup
</pre>
</div>
</div>
</div>

<div id="outline-container-orgff5b49c" class="outline-3">
<h3 id="orgff5b49c">Mónada IO</h3>
<div class="outline-text-3" id="text-orgff5b49c">
<p>
La mónada IO surge como una solución al problema de implementar efectos
secundarios (como la lectura o escritura) en un lenguaje puro y de forma
extensible, sin tener que alterar el sistema de tipos y respetando el
orden en el que queremos que se ejecuten.
</p>

<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #cae682;">greeting</span> <span style="color: #cae682;">::</span> <span style="color: #92a65e; font-weight: bold;">IO</span> <span style="color: #DCDCCC; font-weight: bold;">()</span>
<span style="color: #cae682;">greeting</span> <span style="color: #cae682;">=</span> fmap <span style="color: #DCDCCC;">(</span><span style="color: #95e454;">"Hola, "</span><span style="color: #cae682;">++</span><span style="color: #DCDCCC;">)</span> getLine <span style="color: #cae682;">&gt;&gt;=</span> print
</pre>
</div>

<p>
Pueden leerse más detalles sobre mónada IO y su implementación en:
</p>

<ul class="org-ul">
<li><a href="http://chris-taylor.github.io/blog/2013/02/09/io-is-not-a-side-effect/">IO is pure</a> - Chris Taylor</li>
<li><a href="https://www.microsoft.com/en-us/research/wp-content/uploads/1993/01/imperative.pdf">Imperative functional programming</a> - Simon L. Peyton Jones, Philip Wadler</li>
<li><a href="https://blog.jle.im/entry/first-class-statements">First-Class “Statements”</a> - Justin Le</li>
</ul>
</div>
</div>
