monadas.html

<div id="outline-container-orgd46e27a" class="outline-3">
<h3 id="orgd46e27a">Mónada estado</h3>
<div class="outline-text-3" id="text-orgd46e27a">
<p>
En ocasiones necesitamos que nuestras funciones conserven un estado
además de realizar sus operaciones. Para esos casos existe la mónada
estado <code>State s</code>, que guarda un valor de estado de tipo <code>s</code>. Podemos
pensar en <code>State s a</code> como <code>s -&gt; (a,s)</code>; es decir, un elemento dentro de
la mónada es una función dispuesta a tomar un estado inicial y a
devolver algún elemento junto a un estado final.
</p>

<p>
Existen tutoriales sobre la mónada estado en:
</p>

<ul class="org-ul">
<li><a href="https://wiki.haskell.org/State_Monad">State Monad - Haskell wiki</a></li>
<li><a href="http://learnyouahaskell.com/for-a-few-monads-more">For a few monads more - Learn you a Haskell</a></li>
<li><a href="http://brandon.si/code/the-state-monad-a-tutorial-for-the-confused/">The State Monad: a tutorial for the confused - Brandon Simmons</a></li>
<li><a href="http://adit.io/posts/2013-06-10-three-useful-monads.html">Three useful monads - Aditya Bhargava</a></li>
</ul>

<p>
Un uso de la mónada estado puede ser el guardar la semilla de una
generación pseudoaleatoria de números usando
<a href="https://en.wikipedia.org/wiki/Linear_congruential_generator">generadores lineales congruenciales</a>. En concreto, usaremos la fórmula iterativa
\(x_{i+1} \equiv 16807x_i \text{ mod } 2147483647\), que se expone <a href="https://math.dartmouth.edu/archive/m20f11/public_html/RANDOMNESS_LCG.pdf">aquí</a>.
Con este generador podremos escribir dados de un número dado de caras y
llamarlos varias veces. El estado interno pasará la semilla aleatoria de
un dado al siguiente:
</p>

<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #8ac6f2; font-weight: bold;">import</span> <span style="color: #92a65e; font-weight: bold;">Control.Monad.State</span>
<span style="color: #8ac6f2; font-weight: bold;">type</span> <span style="color: #92a65e; font-weight: bold;">Seed</span> <span style="color: #cae682;">=</span> <span style="color: #92a65e; font-weight: bold;">Int</span>

<span style="color: #cae682;">dice</span> <span style="color: #cae682;">::</span> <span style="color: #92a65e; font-weight: bold;">Int</span> <span style="color: #cae682;">-&gt;</span> <span style="color: #92a65e; font-weight: bold;">State</span> <span style="color: #92a65e; font-weight: bold;">Seed</span> <span style="color: #92a65e; font-weight: bold;">Int</span>
<span style="color: #cae682;">dice</span> n <span style="color: #cae682;">=</span> state <span style="color: #DCDCCC;">(</span><span style="color: #cae682;">\</span>s <span style="color: #cae682;">-&gt;</span> <span style="color: #BFEBBF;">(</span>s <span style="color: #cae682;">`mod`</span> n <span style="color: #cae682;">+</span> 1, 16807<span style="color: #cae682;">*</span>s <span style="color: #cae682;">`mod`</span> 2147483647<span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>
</pre>
</div>

<p>
Y podríamos llamarlo con la semilla <code>1000</code> de la forma siguiente; que
nos devolverá por un lado el resultado de la tirada y por otro lado la
nueva semilla:
</p>

<pre class="example">
λ&gt; runState (dice 6) 1000
(5,1660)
</pre>

<p>
Si queremos hacer varias tiradas seguidas, podemos usar
<code>replicateM :: Int -&gt; m a -&gt; m [a]</code>, que se encarga de pasar
internamente la semilla de cada tirada a la siguiente tirada:
</p>

<pre class="example">
λ&gt; fst (runState (replicateM 100 (dice 6)) 1037)

[6,6,2,5,4,3,6,1,4,6,3,6,4,4,6,3,5,1,5,2,6,4,2,6,4,2,4,
5,1,6,5,4,1,3,5,4,6,4,2,3,4,2,1,1,6,5,5,4,1,1,4,6,5,3,6,
3,1,1,5,1,4,1,2,3,5,5,4,5,3,3,2,6,4,1,1,1,2,5,4,5,2,4,5,
6,1,2,4,3,3,6,4,6,3,4,5,1,4,2,2,2]
</pre>

<p>
Incluso podemos crear nuevos generadores aleatorios a partir de los
anteriores con las operaciones usuales:
</p>

<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #cae682;">twodices</span> <span style="color: #cae682;">::</span> <span style="color: #92a65e; font-weight: bold;">State</span> <span style="color: #92a65e; font-weight: bold;">Seed</span> <span style="color: #92a65e; font-weight: bold;">Int</span>
<span style="color: #cae682;">twodices</span> <span style="color: #cae682;">=</span> <span style="color: #8ac6f2; font-weight: bold;">do</span>
    a <span style="color: #cae682;">&lt;-</span> dice 6
    b <span style="color: #cae682;">&lt;-</span> dice 6
    return <span style="color: #DCDCCC;">(</span>a<span style="color: #cae682;">+</span>b<span style="color: #DCDCCC;">)</span>
</pre>
</div>

<p>
Cuando lo llamemos, tomará la distribución suma de las dos
distribuciones de dados:
</p>

<pre class="example">
λ&gt; fst (runState (replicateM 100 twodices) 1032)

[8,11,8,8,5,3,7,8,9,5,2,6,7,9,8,7,5,9,3,9,10,7,7,10,
8,2,5,6,4,10,8,6,4,6,4,8,9,7,12,11,9,3,2,7,5,5,6,10,
6,6,3,11,4,7,3,6,3,7,10,4,4,11,4,10,3,5,2,8,4,10,12,
8,9,5,9,11,6,4,10,6,6,12,5,2,7,8,7,4,4,4,9,6,6,6,3,
11,11,9,7,6]
</pre>
</div>
</div>
</div>

<div id="outline-container-org30ff0f7" class="outline-2">
<h2 id="org30ff0f7">Mónadas en teoría de categorías</h2>
<div class="outline-text-2" id="text-org30ff0f7">
<p>
Para entender cómo funcionan las <a href="https://es.wikipedia.org/wiki/M%C3%B3nada_(teor%C3%ADa_de_categor%C3%ADas)">mónadas</a>
en teoría de categorías tenemos que entender dos conceptos: los
<i>productos en una <a href="https://es.wikipedia.org/wiki/Categor%C3%ADa_monoidal">categoría monoidal</a></i> y <i>los endofuntores de una categoría</i>. 
La unión de ambos conceptos es lo que nos dará las mónadas como una 
construcción en teoría de categorías.
</p>
</div>

<div id="outline-container-org73c8c23" class="outline-3">
<h3 id="org73c8c23">Categorías monoidales</h3>
<div class="outline-text-3" id="text-org73c8c23">
<p>
Simplificando, una categoría monoidal es aquella donde, dados dos
objetos \(A,B\), tenemos un objeto <i>"producto tensor"</i> de ambos,
\(A \otimes B\), donde además existe un objeto identidad \(I\)
cumpliendo propiedades como:
</p>

<p>
\[A \otimes B \cong B \otimes A\]
</p>

<p>
\[A \otimes (B \otimes C) \cong (A \otimes B) \otimes C\]
</p>

<p>
\[A \otimes I \cong A\]
</p>
</div>
</div>

<div id="outline-container-orgf261b3b" class="outline-3">
<h3 id="orgf261b3b">Ejemplos de categorías monoidales</h3>
<div class="outline-text-3" id="text-orgf261b3b">
<p>
Los <b>conjuntos</b> con el producto cartesiano y el conjunto de un elemento
forman ya una categoría monoidal. Puede comprobarse sobre ellos que
existen los isomorfismos:
</p>

<p>
\[A \times B \cong B \times A\]
</p>

<p>
\[A \times (B \times C) \cong (A \times B) \times C\]
</p>

<p>
\[A \times \{\bullet\} \cong A\]
</p>

<p>
Pero además, podemos darles <i>otra</i> estructura de categoría monoidal,
esta vez con la <a href="https://es.wikipedia.org/wiki/Uni%C3%B3n_disjunta">unión disjunta</a> y el conjunto vacío:
</p>

<p>
\[A \sqcup B \cong B \sqcup A\]
</p>

<p>
\[A \sqcup (B \sqcup C) \cong (A \sqcup B) \sqcup C\]
</p>

<p>
\[A \sqcup \varnothing \cong A\]
</p>

<p>
En general, <b>todas las categorías con productos finitos son categorías
monoidales</b> con el producto categórico y el objeto terminal como unidad.
Todas las categorías con coproductos finitos son categorías monoidales
con el coproducto categórico y el objeto inicial como unidad.
</p>

<p>
Otro ejemplo distinto lo forman los <b>espacios vectoriales</b> sobre un
cuerpo \(K\) con el producto tensor y el propio cuerpo sirviendo como
unidad; o los <b>grupos abelianos</b> con el producto tensor y \(\mathbb{Z}\)
siendo la unidad.
</p>
</div>
</div>

<div id="outline-container-org1d892fb" class="outline-3">
<h3 id="org1d892fb">Objetos monoide</h3>
<div class="outline-text-3" id="text-org1d892fb">
<p>
Un objeto \(A\) de una categoría monoidal es objeto monoide cuando puedo
definir un morfismo desde el objeto identidad hacia él y un morfismo
desde el producto tensor \(A \otimes A\) hacia él. Es decir, hay un
morfismo <i>unidad</i>, \(I \overset{u}\longrightarrow A\); y hay un morfismo <i>multiplicación</i>,
\(A \otimes A \overset{\mu}\longrightarrow A\).
</p>

<p>
Cumpliendo ciertas propiedades similares a las que exigimos a un
monoide. De hecho, un objeto monoide en la categoría de los conjuntos
con el producto cartesiano es simplemente un <b>monoide</b> normal y
corriente.
</p>
</div>
</div>
