monadas.html

<div id="outline-container-orge539548" class="outline-3">
<h3 id="orge539548">Categorías de endofuntores</h3>
<div class="outline-text-3" id="text-orge539548">
<p>
El ejemplo que nos interesa ahora, sin embargo, es el de los
<b>endofuntores</b> de una categoría. Un <b>funtor</b>, de forma simplificada, es
una <i>aplicación entre categorías</i>; que lleva objetos en objetos y
morfismos en morfismos, respetando además el punto de inicio y fin de
cada morfismo.
</p>

<p>
Si consideramos los funtores de una categoría a sí misma, tenemos los
<b>endofuntores</b> de la categoría. Y entre ellos existen transformaciones
naturales que actúan como morfismos en el sentido de que se componen
para dar otras transformaciones naturales. Teniendo unos objetos (los
endofuntores), y unos morfismos (las transformaciones naturales),
tenemos una categoría. Nótese que hemos abstraído mucho, estamos
trabajando con una categoría en la que cada objeto es en sí mismo un
endofuntor y cada morfismo es toda una transformación natural entre dos
funtores.
</p>

<p>
Esta es además una categoría monoidal. El producto tensor de esta
categoría monoidal será la composición \(\circ\), y el objeto identidad
el endofuntor identidad, que actúa dejando fijo cada objeto y cada
morfismo.
</p>
</div>
</div>

<div id="outline-container-org967809b" class="outline-3">
<h3 id="org967809b">Mónadas</h3>
<div class="outline-text-3" id="text-org967809b">
<p>
Pues bien, una mónada es un objeto monoide en la categoría de los
endofuntores con la composición como producto tensor. Esto quiere decir
que es un endofuntor \(F\) con transformaciones naturales:
</p>

<p>
\[F \circ F \Rightarrow F\]
</p>

<p>
\[I \Rightarrow F\]
</p>

<p>
Como una transformación natural nos da un morfismo por cada objeto en el
que se aplica el funtor, lo que tenemos son familias de morfismos:
</p>

<p>
\[F(F(X)) \overset{\mu_x}\longrightarrow F(X)\]
</p>

<p>
\[X \overset{r_x}\longrightarrow F(X)\]
</p>
</div>
</div>

<div id="outline-container-org03354ac" class="outline-3">
<h3 id="org03354ac">Una categoría para la programación funcional</h3>
<div class="outline-text-3" id="text-org03354ac">
<p>
Algunos sistemas de tipos, con las funciones entre ellos <code>A -&gt; B</code> como
morfismos, forman una categoría[3]. No es el caso de Haskell, en el que,
por varios motivos, sus tipos no forman una categoría[4]; pero las
construcciones con inspiración en la teoría de categorías toman el
nombre de sus homólogas.[5]
</p>

<p>
El primer ejemplo de esto son los <b>funtores</b>. En Haskell, un funtor se
define como:
</p>

<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #8ac6f2; font-weight: bold;">class</span> <span style="color: #92a65e; font-weight: bold;">Functor</span> f <span style="color: #8ac6f2; font-weight: bold;">where</span> 
  fmap <span style="color: #cae682;">::</span> <span style="color: #DCDCCC;">(</span>a <span style="color: #cae682;">-&gt;</span> b<span style="color: #DCDCCC;">)</span> <span style="color: #cae682;">-&gt;</span> f a <span style="color: #cae682;">-&gt;</span> f b 
</pre>
</div>

<p>
Es decir un funtor toma un tipo <code>a</code> (un objeto de la categoría), y nos
devuelve otro tipo <code>f a</code> (otro objeto de la <i>misma</i> categoría). Por otro
lado, el funtor toma un morfismo <code>a -&gt; b</code> y nos devuelve otro morfismo
<code>f a -&gt; f b</code>. Es decir, los funtores de la programación funcional son
<b>endofuntores en la categoría de los tipos</b>, siempre que conserven
ciertas reglas que tienen su reflejo en las reglas de funtores en
Haskell.
</p>
</div>
</div>

<div id="outline-container-org8087e1b" class="outline-3">
<h3 id="org8087e1b">Monoides en la categoría de los endofuntores</h3>
<div class="outline-text-3" id="text-org8087e1b">
<p>
Entonces, si los funtores <code>f :: * -&gt; *</code> son endofuntores en alguna
categoría, tiene sentido cuestionarse cuáles de ellos son monoides.
Esto, junto con ciertas restricciones que se le imponen como leyes a las
mónadas, equivale a decir que existen los morfismos dados por las
transformaciones naturales que pedíamos antes, es decir, deben existir
morfismos de tipos <code>a -&gt; m a</code> y <code>m (m a) -&gt; m a</code>:
</p>

<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #cae682;">return</span> <span style="color: #cae682;">::</span> a <span style="color: #cae682;">-&gt;</span> m a
<span style="color: #cae682;">join</span> <span style="color: #cae682;">::</span> m <span style="color: #DCDCCC;">(</span>m a<span style="color: #DCDCCC;">)</span> <span style="color: #cae682;">-&gt;</span> m a
</pre>
</div>

<p>
Así, a cualquier funtor que tiene estos dos morfismos, además del <code>fmap</code>
que tenía por ser funtor, lo llamamos <b>mónada</b>. Nótese que <code>&gt;&gt;=</code> puede
implementarse desde <code>join</code> y viceversa, como:
</p>

<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #DCDCCC;">(</span><span style="color: #cae682;">&gt;&gt;=</span><span style="color: #DCDCCC;">)</span> <span style="color: #cae682;">::</span> m a <span style="color: #cae682;">-&gt;</span> <span style="color: #DCDCCC;">(</span>a <span style="color: #cae682;">-&gt;</span> m b<span style="color: #DCDCCC;">)</span> <span style="color: #cae682;">-&gt;</span> m b
<span style="color: #DCDCCC;">(</span><span style="color: #cae682;">&gt;&gt;=</span><span style="color: #DCDCCC;">)</span> x f <span style="color: #cae682;">=</span> join <span style="color: #DCDCCC;">(</span>fmap f a<span style="color: #DCDCCC;">)</span>

<span style="color: #cae682;">join</span> <span style="color: #cae682;">::</span> m <span style="color: #DCDCCC;">(</span>m a<span style="color: #DCDCCC;">)</span> <span style="color: #cae682;">-&gt;</span> m a
<span style="color: #cae682;">join</span> x <span style="color: #cae682;">=</span> x <span style="color: #cae682;">&gt;&gt;=</span> id
</pre>
</div>

<p>
Tenemos entonces dos definiciones equivalentes de lo que es una mónada.
Una desde la teoría de categorías y otra desde la teoría de tipos y los
lenguajes de programación funcional. Una visión desde las mónadas como
monoides en la categoría de los endofuntores desde dentro de Haskell
puede verse <a href="http://blog.sigfpe.com/2008/11/from-monoids-to-monads.html">aquí</a>.
</p>
</div>
</div>
</div>

<div id="outline-container-orga125aae" class="outline-2">
<h2 id="orga125aae">Y más</h2>
<div class="outline-text-2" id="text-orga125aae">
<p>
Además de las enunciadas en este post, existen más otros temas
relevantes en relación a las mónadas, tanto en programación funcional
como en teoría de categorías:
</p>

<ul class="org-ul">
<li><a href="http://book.realworldhaskell.org/read/monad-transformers.html">Transformadores de mónadas</a>, usadas para componer mónadas.</li>
<li><a href="http://stackoverflow.com/questions/8428554/what-is-the-comonad-typeclass-in-haskell">Comónadas</a>, la noción dual de una mónada.</li>
<li><a href="https://en.wikipedia.org/wiki/Kleisli_category">Categorías de Kleisli</a>, cada mónada da lugar a una categoría de Kleisli.</li>
<li><a href="https://en.wikipedia.org/wiki/Adjoint_functors">Funtores adjuntos</a>, cada par de funtores adjuntos da lugar a una mónada.</li>
<li><a href="http://www.cs.tufts.edu/comp/150FP/archive/brent-yorgey/tc.pdf">Typeclassopedia</a>, una revisión de otras clases de tipos relevantes en Haskell y
relacionadas con la teoría de categorías.</li>
</ul>
</div>
</div>

<div id="outline-container-org180b239" class="outline-2">
<h2 id="org180b239">Referencias</h2>
<div class="outline-text-2" id="text-org180b239">
<p>
[1] Peligros de la notación do.
    <a href="https://wiki.haskell.org/Do_notation_considered_harmful">Do notation considered harmful</a>
</p>

<p>
[2] Enumerando los racionales.
    <a href="http://www.cs.ox.ac.uk/people/jeremy.gibbons/publications/rationals.pdf">Enumerating the rationals - J. Gibbons, D. Lester, R. Bird</a>
</p>

<p>
[3] La correspondencia entre tipos, lógica y categorías.
    <a href="https://ncatlab.org/nlab/show/computational+trinitarianism">Computational Trinitarianism - NLab</a>
</p>

<p>
[4] Por qué los tipos de Haskell no son una categoría.
    <a href="http://math.andrej.com/2016/08/06/hask-is-not-a-category/">Hask is not a category - Andrej Bauer</a>
</p>

<p>
[5] Por qué en ocasiones puede ser útil pensar en ellos como una
    categoría.
    <a href="https://ro-che.info/articles/2016-08-07-hask-category">Does it matter if Hask is (not) a category?</a></p>
</div>
</div>
</div>
<div id="postamble" class="status">
<div id="footer"><p class="postamble">Last edited 2016-12-24 Sat 15:09. Written by <a href="https://mroman42.github.com">@mroman42</a>.</p></div>
</div>
</body>
</html>
